[
  {
    "goal": "reduce-plastic",
    "level": "beginner",
    "challenges": [
      "Bring a reusable water bottle instead of buying plastic bottles.",
      "Use a reusable tote bag instead of plastic bags.",
      "Say no to plastic straws when eating out.",
      "Use a reusable lunchbox instead of plastic wrap or bags.",
      "Buy loose fruits and vegetables instead of packaged ones."
    ]
  },
  {
    "goal": "reduce-plastic",
    "level": "intermediate",
    "challenges": [
      "Carry a set of reusable cutlery when eating out.",
      "Store food in glass or stainless steel containers instead of plastic.",
      "Avoid buying bottled beverages—bring your own cup.",
      "Choose products with minimal or compostable packaging.",
      "Wash & reuse plastic food containers instead of discarding them."
    ]
  },
  {
    "goal": "reduce-plastic",
    "level": "advanced",
    "challenges": [
      "Switch to plastic-free personal care products (e.g., shampoo bars).",
      "Find a local refill station for bulk food or household products.",
      "Completely eliminate plastic utensils & straws at home.",
      "Join or organize a community cleanup to remove plastic waste.",
      "Advocate for plastic-free policies at your workplace or school."
    ]
  },
  {
    "goal": "save-energy",
    "level": "beginner",
    "challenges": [
      "Turn off lights when leaving a room.",
      "Unplug electronics when not in use.",
      "Use a power strip to turn off multiple devices at once.",
      "Let clothes air dry instead of using a dryer.",
      "Use energy-efficient LED bulbs instead of incandescent ones."
    ]
  },
  {
    "goal": "save-energy",
    "level": "intermediate",
    "challenges": [
      "Keep your fridge full (less empty space = less energy needed).",
      "Set your thermostat 2°F lower in winter and higher in summer.",
      "Use a fan instead of air conditioning when possible.",
      "Reduce screen brightness on electronic devices to save energy.",
      "Turn off your computer/laptop when not in use instead of sleep mode."
    ]
  },
  {
    "goal": "save-energy",
    "level": "advanced",
    "challenges": [
      "Cook with a lid on pots to use less energy.",
      "Switch to a renewable energy provider if available.",
      "Install blackout curtains or use reflective window film to regulate indoor temperature.",
      "Completely eliminate standby power consumption by unplugging all devices when not in use.",
      "Avoid using electric space heaters—layer up instead."
    ]
  },
  {
    "goal": "waste-less-water",
    "level": "beginner",
    "challenges": [
      "Turn off the tap while brushing your teeth.",
      "Take a 5-minute shower instead of a long one.",
      "Use a full load when washing clothes or dishes.",
      "Water plants in the early morning or evening to reduce evaporation.",
      "Reuse cooking water (e.g., for watering plants)."
    ]
  },
  {
    "goal": "waste-less-water",
    "level": "intermediate",
    "challenges": [
      "Collect rainwater for watering plants or cleaning.",
      "Fix leaky faucets and pipes to prevent water waste.",
      "Use a dishwasher instead of handwashing (if you have one—it saves water!).",
      "Switch to a water-efficient showerhead or faucet aerator.",
      "Use leftover drinking water to water plants instead of pouring it out."
    ]
  },
  {
    "goal": "waste-less-water",
    "level": "advanced",
    "challenges": [
      "Install a greywater system to reuse water from sinks & showers.",
      "Replace your lawn with drought-tolerant plants or a garden.",
      "Install a dual-flush toilet to use less water per flush.",
      "Avoid baths—stick to short showers.",
      "Advocate for water conservation policies in your workplace or community."
    ]
  },
  {
    "goal": "random",
    "level": "beginner",
    "challenges": [
      "Recycle one plastic, paper, or glass item today.",
      "Eat a plant-based meal once a week to reduce your carbon footprint.",
      "Pick up litter during a walk outside.",
      "Share a sustainability tip with a friend or on social media.",
      "Use public transport, bike, or walk instead of driving."
    ]
  },
  {
    "goal": "random",
    "level": "intermediate",
    "challenges": [
      "Start a compost bin for food scraps.",
      "Reduce food waste by planning meals ahead.",
      "Buy second-hand clothes instead of new ones.",
      "Switch to eco-friendly cleaning products.",
      "Reduce paper waste—opt for digital receipts & notes."
    ]
  },
  {
    "goal": "random",
    "level": "advanced",
    "challenges": [
      "Set up a home vegetable or herb garden.",
      "Install solar panels or use a portable solar charger.",
      "Completely eliminate single-use plastics from your household.",
      "Join a community sustainability group or initiative.",
      "Write to a local representative about environmental issues."
    ]
  },
  {
    "goal": "eco-friendly-travel",
    "level": "beginner",
    "challenges": [
      "Walk or bike for short trips instead of driving.",
      "Carpool with coworkers or friends when commuting.",
      "Take public transportation instead of driving alone.",
      "Bring a reusable coffee cup when traveling.",
      "Avoid single-use plastics while traveling (e.g., hotel toiletries)."
    ]
  },
  {
    "goal": "eco-friendly-travel",
    "level": "intermediate",
    "challenges": [
      "Choose eco-friendly accommodations when traveling.",
      "Pack light to reduce fuel consumption in transport.",
      "Use a refillable water bottle instead of buying bottled water while traveling.",
      "Support local and sustainable businesses during trips.",
      "Opt for train travel instead of flying when possible."
    ]
  },
  {
    "goal": "eco-friendly-travel",
    "level": "advanced",
    "challenges": [
      "Offset your carbon footprint when booking flights.",
      "Plan a zero-waste trip by packing reusable essentials.",
      "Avoid cruises due to their high environmental impact.",
      "Advocate for eco-friendly tourism in your community.",
      "Choose travel destinations that support conservation efforts."
    ]
  },
  {
    "goal": "sustainable-fashion",
    "level": "beginner",
    "challenges": [
      "Wear clothes you already own instead of buying new ones.",
      "Donate clothes instead of throwing them away.",
      "Repair small damages instead of discarding clothing.",
      "Buy second-hand clothing instead of new.",
      "Wash clothes with cold water to save energy."
    ]
  },
  {
    "goal": "sustainable-fashion",
    "level": "intermediate",
    "challenges": [
      "Host or participate in a clothing swap.",
      "Support ethical and sustainable clothing brands.",
      "Reduce laundry frequency to save water and energy.",
      "Choose natural fibers like organic cotton over synthetic fabrics.",
      "Avoid fast fashion—invest in quality pieces that last longer."
    ]
  },
  {
    "goal": "sustainable-fashion",
    "level": "advanced",
    "challenges": [
      "Learn to sew and upcycle old clothing.",
      "Create a capsule wardrobe to minimize fashion waste.",
      "Dye or alter clothing instead of replacing them.",
      "Advocate for ethical labor practices in fashion.",
      "Completely eliminate fast fashion purchases."
    ]
  },
  {
    "goal": "green-home",
    "level": "beginner",
    "challenges": [
      "Switch to reusable cleaning cloths instead of paper towels.",
      "Use natural light instead of artificial lighting during the day.",
      "Unplug chargers and appliances when not in use.",
      "Use non-toxic cleaning products for a healthier home.",
      "Open windows for ventilation instead of using air fresheners."
    ]
  },
  {
    "goal": "green-home",
    "level": "intermediate",
    "challenges": [
      "Switch to bamboo or biodegradable household items.",
      "Reduce waste by repurposing items around the house.",
      "Compost kitchen scraps instead of throwing them away.",
      "Install a water filter instead of buying bottled water.",
      "Use motion sensor lights to save energy."
    ]
  },
  {
    "goal": "green-home",
    "level": "advanced",
    "challenges": [
      "Install solar panels to power your home.",
      "Replace old appliances with energy-efficient models.",
      "Grow your own herbs or vegetables indoors.",
      "Use a rainwater harvesting system for watering plants.",
      "Advocate for green building policies in your community."
    ]
  },
  {
    "goal": "zero-waste-lifestyle",
    "level": "beginner",
    "challenges": [
      "Say no to receipts—opt for digital versions.",
      "Use a handkerchief instead of disposable tissues.",
      "Bring a reusable shopping bag everywhere.",
      "Avoid individually wrapped snacks and buy in bulk.",
      "Recycle paper, glass, and plastic waste properly."
    ]
  },
  {
    "goal": "zero-waste-lifestyle",
    "level": "intermediate",
    "challenges": [
      "Start making your own DIY natural beauty products.",
      "Shop at bulk stores and use your own containers.",
      "Use cloth napkins instead of disposable ones.",
      "Find creative ways to repurpose household waste.",
      "Track your trash for a week and identify wasteful habits."
    ]
  },
  {
    "goal": "zero-waste-lifestyle",
    "level": "advanced",
    "challenges": [
      "Completely eliminate disposable items from your home.",
      "Create a zero-waste shopping kit (jars, bags, utensils).",
      "Make homemade cleaning products to reduce packaging waste.",
      "Live plastic-free for a whole month.",
      "Organize a zero-waste challenge for your community."
    ]
  },
  {
    "goal": "sustainable-food",
    "level": "beginner",
    "challenges": [
      "Eat one meat-free meal per week.",
      "Reduce food waste by storing leftovers properly.",
      "Choose seasonal fruits and vegetables.",
      "Drink tap water instead of bottled water.",
      "Bring your own reusable container for takeout food."
    ]
  },
  {
    "goal": "sustainable-food",
    "level": "intermediate",
    "challenges": [
      "Support local farmers by shopping at farmers' markets.",
      "Plan meals in advance to minimize food waste.",
      "Grow your own herbs or vegetables at home.",
      "Reduce processed food consumption for a greener diet.",
      "Make homemade snacks instead of buying packaged ones."
    ]
  },
  {
    "goal": "sustainable-food",
    "level": "advanced",
    "challenges": [
      "Completely eliminate food waste at home.",
      "Start a compost bin for food scraps.",
      "Adopt a plant-based diet for a whole week.",
      "Only buy organic, fair-trade, or sustainably sourced foods.",
      "Advocate for sustainable food policies in your community."
    ]
  }
]
